INCOME = 'доход'
EXPENSE = 'расход'
BALANCE = 'баланс'
TRANSACTIONS_QUANTITY = 'количество транзакций'
POPULAR_CATEGORIES = 'популярные категории'

WINTER = 'Зима'
SPRING = 'Весна'
SUMMER = 'Лето'
AUTUMN = 'Осень'


# Headlines
PR_FINANCIAL_REPORT = '⭐⭐⭐ ФИНАНСОВЫЙ ОТЧЕТ ⭐⭐⭐'
PR_KEY_INDICATORS = '=== ОСНОВНЫЕ ПОКАЗАТЕЛИ ==='
PR_CATEGORY_EXPENSES = '=== РАСХОДЫ ПО КАТЕГОРИЯМ ==='
PR_MONTHLY_EXPENSES = '=== РАСХОДЫ ПО МЕСЯЦАМ ==='
PR_HISTORICAL_ANALYSIS = '=== АНАЛИЗ ИСТОРИЧЕСКИХ ДАННЫХ ==='
PR_BUDGET = '=== БЮДЖЕТ ==='

# Basic terms
PR_REQUEST = 'Введите имя файла (в формате user_data.csv или user_data.json): '
PR_INCOME = '💰 Доходы:'
PR_EXPENSE = '💸 Расходы:'
PR_BALANCE = '⚖️ Баланс:'
PR_NUM_TRANS = 'Количество транзакций за год:'
PR_RUB = 'руб.'
PR_CATEGORY = 'Категория'
PR_MONTH = 'Месяц'
PR_EXPENSES = 'Расходы'
PR_INCOMES = 'Доходы'
PR_TRANSACTION_COUNT = 'Количество транзакций'
PR_PERCENT_OF_TOTAL = 'Процент от общих расходов'
PR_POPULAR_CATEGORIES = 'Самые частые категории трат'
PR_AVERAGE_COSTS = 'Средние затраты по категориям, за месяц'
PR_SEASONAL_PATTERNS = 'Сезонные закономерности'
PR_SEASON_PAT_HIGH_COSTS = 'Наибольшие затраты наблюдаются в сезон'
PR_SEASON_PAT_SMALL_COSTS = 'Наименьшие затраты наблюдаются в сезон'
PR_SEASON_PAT_EQUAL = 'и равны'
PR_BIGGEST_EXPENSES = 'Самые большие траты в категориях'
PR_RECOMMENDATIONS = 'Рекомендации для планирования'
PR_RECOMMEND_PLAN = 'Попробуйте сократить траты на'
PR_BY = 'на'

# Budget
PR_BUDGET_DISTRIBUTION = 'Вам предлагается следующее бюджетное распределение, в соответствии с потребностями современного человека:'
PR_BUDGET_ESSENTIALS = '45-55% - жилье, коммунальные платежи, продукты, транспорт, здоровье'
PR_BUDGET_LIFESTYLE = '25-35% - развлечения, хобби, одежда, образование'
PR_BUDGET_SAVINGS = '15-25% - сбережения'
PR_BUDGET_SUCCESS = '✅ Отлично! Вы укладываетесь в бюджет'
PR_BUDGET_FAILURE = '❌ К сожалению, Вы не уложились в бюджет. Ваше распределение средств:'
PR_BUDGET_CATEGORY_1 = 'Категория 1: '
PR_BUDGET_CATEGORY_2 = 'Категория 2: '
PR_BUDGET_CATEGORY_3 = 'Категория 3: '

#mounth dict
month_ru = {1: 'январь', 2: 'февраль', 3: 'март', 4: 'апрель',
            5: 'май', 6: 'июнь', 7: 'июль', 8: 'август', 9: 'сентябрь',
            10: 'октябрь', 11: 'ноябрь', 12: 'декабрь'}
